n = []
n1 = []
n2 = []
n3 = []
for i in range(10000, 1000000):
    n.append(i)

for i in n:
    if i // 10000 % 10 == i % 10 and i // 1000 % 10 == i // 10 % 10:
        n1.append(i)

for i in n1:
    if (i+1) // 10000 % 10 == (i + 1) % 10 and (i + 1) // 1000 % 10 == (i + 1) // 10 % 10:
        n2.append(i)

for i in n2:
    if (i+2) // 10000 % 10 == (i + 2) // 10 % 10 and (i + 2) // 1000 % 10 == (i + 2) // 100 % 10:
        n3.append(i)

for i in n3:
    if ((i + 3) // 100000 == (i + 3) % 10 and (i+3) // 10000 % 10 == (i + 3) // 10 % 10 and
            (i + 3) // 1000 % 10 == (i + 3) // 100 % 10):
        print('В самом начале пробег был:', i)

#ответ: 199999